pascal-4.0/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlock2D/0.org/region_dynamic/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    trackedSurface
    {
        type            calculated;
        value           $internalField;
    }
    fixedWall
    {
        type            calculated;
        value           $internalField;
    }
    fixedMesh
    {
        type            calculated;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0;
    }
}


// ************************************************************************* //
